[
  {
    "year": 1901,
    "day": "30 June",
    "text": "The Socialist-Revolutionary Party was founded."
  },
  {
    "year": 1901,
    "day": "30 June",
    "text": "Russification of Finland: The Military Service Act incorporated the Finnish and Russian armies."
  },
  {
    "year": 1902,
    "day": "20 March",
    "text": "Russification of Finland: Nikolai Ivanovich Bobrikov, the Governor-General of Finland, was given the power to dismiss opponents of Russification from the Finnish government."
  },
  {
    "year": 1903,
    "day": "20 March",
    "text": "Russification of Finland: The office of the Governor-General was given dictatorial powers."
  },
  {
    "year": 1903,
    "day": "6 April",
    "text": "Kishinev pogrom: A three-day pogrom began, which would leave forty-seven Jews dead."
  },
  {
    "year": 1903,
    "day": "17 November",
    "text": "At the second congress of the RSDLP, the party split into two factions: the Bolsheviks, led by Vladimir Lenin, and the less radical Mensheviks."
  },
  {
    "year": 1904,
    "day": "8 February",
    "text": "Russo-Japanese War: Japan launched a surprise torpedo attack on the Russian navy at Port Arthur."
  },
  {
    "year": 1905,
    "day": "3 January",
    "text": "Russian Revolution of 1905: A strike began at the Putilov Works in St. Petersburg."
  },
  {
    "year": 1905,
    "day": "9 January",
    "text": "Bloody Sunday (1905): Peaceful demonstrators arrived at the Winter Palace in Saint Petersburg to present a petition to the tsar, leading was a priest named Georgi Gapon. The Imperial Guard fired on the crowd, killing around 200 and wounding 800."
  },
  {
    "year": 1905,
    "day": "27–28 May",
    "text": "Russo-Japanese War: The Russian Baltic Fleet was practically destroyed in the Battle of Tsushima, effectively ending the Russo-Japanese War in Japan's favour."
  },
  {
    "year": 1905,
    "day": "28 May",
    "text": "Russian Revolution of 1905: The first soviet was formed in the midst of a textile strike in Ivanovo-Voznesensk."
  },
  {
    "year": 1905,
    "day": "14 June",
    "text": "Russian Revolution of 1905: A mutiny occurred aboard the battleship Potemkin."
  },
  {
    "year": 1905,
    "day": "25 June",
    "text": "Russian Revolution of 1905: The Potemkin sailors defected to Romania."
  },
  {
    "year": 1905,
    "day": "5 September",
    "text": "Russo-Japanese War: The Treaty of Portsmouth was signed, ceding some Russian property and territory to Japan and ending the war."
  },
  {
    "year": 1905,
    "day": "17 October",
    "text": "Russian Revolution of 1905: Nicholas signed the October Manifesto, expanding civil liberties and establishing and empowering the first State Duma of the Russian Empire."
  },
  {
    "year": 1906,
    "day": "March",
    "text": "1906 Russian legislative election: The first free elections to the Duma gave majorities to liberal and socialist parties."
  },
  {
    "year": 1906,
    "day": "23 April",
    "text": "The Fundamental Laws were issued, reaffirming the autocratic supremacy of the tsar."
  },
  {
    "year": 1906,
    "day": "23 April",
    "text": "The First Duma was called."
  },
  {
    "year": 1906,
    "day": "21 July",
    "text": "The First Duma was dissolved."
  },
  {
    "year": 1906,
    "day": "23 July",
    "text": "The Constitutional Democratic party (Kadets) issued the Vyborg Manifesto, calling on the Russian people to evade taxes and the draft. All signatories to the Manifesto lost their right to hold office in the Duma."
  },
  {
    "year": 1906,
    "day": "9 November",
    "text": "A decree by Prime Minister Pyotr Stolypin signaled the start of the Stolypin reform, intended to replace the obshchina with a more progressive, capitalist form of agriculture."
  },
  {
    "year": 1907,
    "day": "9 February",
    "text": "The secret police units of the MVD Department of State Police were unified under the authority of the new Okhrana."
  },
  {
    "year": 1907,
    "day": "20 February",
    "text": "The Second Duma began. The Kadets dropped seats, benefiting the RSDLP and the Socialist-Revolutionary Party."
  },
  {
    "year": 1907,
    "day": "3 June",
    "text": "The Second Duma was dissolved."
  },
  {
    "year": 1907,
    "day": "3 June",
    "text": "Nicholas changed the electoral law and gave greater electoral value to the votes of nobility and landowners."
  },
  {
    "year": 1907,
    "day": "1 November",
    "text": "The Third Duma began."
  },
  {
    "year": 1912,
    "day": "4 April",
    "text": "Lena goldfields massacre: The Russian army fired on a crowd of striking miners, killing 150."
  },
  {
    "year": 1912,
    "day": "9 June",
    "text": "The Third Duma ended."
  },
  {
    "year": 1912,
    "day": "15 November",
    "text": "The Fourth Duma was called."
  },
  {
    "year": 1914,
    "day": "28 June",
    "text": "Assassination of Archduke Franz Ferdinand: Archduke Franz Ferdinand of Austria was assassinated by Gavrilo Princip of the Bosnian separatist group Young Bosnia."
  },
  {
    "year": 1914,
    "day": "23 July",
    "text": "World War I: Austria-Hungary issued the July Ultimatum to Serbia, demanding, among other things, the right to participate in the investigation into the assassination of Franz Ferdinand, which Serbia refused."
  },
  {
    "year": 1914,
    "day": "28 July",
    "text": "World War I: Austria-Hungary declared war on Serbia."
  },
  {
    "year": 1914,
    "day": "30 July",
    "text": "World War I: Russia mobilized its army to defend Serbia."
  },
  {
    "year": 1914,
    "day": "1 August",
    "text": "World War I: Germany declared war on Russia in defense of Austria-Hungary."
  },
  {
    "year": 1915,
    "day": "2 May",
    "text": "Gorlice-Tarnów Offensive: The German army launched an offensive across the length of the Eastern Front."
  },
  {
    "year": 1915,
    "day": "4 August",
    "text": "Gorlice-Tarnów Offensive: Germany conquered Warsaw."
  },
  {
    "year": 1915,
    "day": "19 September",
    "text": "Gorlice-Tarnów Offensive: German forces captured Vilnius, the capital of Lithuania."
  },
  {
    "year": 1916,
    "day": "25 June",
    "text": "Basmachi Revolt: Nicholas issued a decree ordering the conscription of Central Asians."
  },
  {
    "year": 1916,
    "day": "5 November",
    "text": "By the Act of 5 November, the German government established the nominally independent Kingdom of Poland."
  },
  {
    "year": 1916,
    "day": "16 December",
    "text": "Royal adviser Grigori Rasputin was murdered by a group of nobles in the house of Prince Felix Yussupov."
  },
  {
    "year": 1917,
    "day": "22 February",
    "text": "February Revolution: The workers at the Putilov Plant in Petrograd went on strike."
  },
  {
    "year": 1917,
    "day": "23 February",
    "text": "February Revolution: A series of demonstrations were held, demanding the end of the Russian autocracy and the end of Russian participation in World War I."
  },
  {
    "year": 1917,
    "day": "25 February",
    "text": "February Revolution: A battalion of soldiers was sent to Petrograd to end the uprising."
  },
  {
    "year": 1917,
    "day": "26 February",
    "text": "February Revolution: Nicholas ordered the dissolution of the Fourth Duma. The Duma ignored his order and decreed the establishment of a Provisional Government with Georgy L'vov as Prime Minister."
  },
  {
    "year": 1917,
    "day": "27 February",
    "text": "February Revolution: The soldiers sent to suppress the protestors defected and joined them. It started off as the \"National Women's day\" then, after two days, the women convinced the soldiers to join their revolution due to the fact that they were women and the soldiers did not want to kill them. On top of this, the Cossacks did not try to stop the protestors. Menshevik leaders were freed from the Peter and Paul Fortress and founded the Petrograd Soviet."
  },
  {
    "year": 1917,
    "day": "2 March",
    "text": "February Revolution: Nicholas abdicated."
  },
  {
    "year": 1917,
    "day": "17 March",
    "text": "A legislative council, the Tsentralna Rada, was founded in Ukraine."
  },
  {
    "year": 1917,
    "day": "30 March",
    "text": "The Provisional Government established the autonomous province of Estonia and scheduled elections to an Estonian legislative body, the Maapäev."
  },
  {
    "year": 1917,
    "day": "10 May",
    "text": "The Rumcherod, the Soviet government of southwestern Ukraine and Bessarabia, was established."
  },
  {
    "year": 1917,
    "day": "23 June",
    "text": "The Tsentralna Rada ratified Ukrainian autonomy."
  },
  {
    "year": 1917,
    "day": "3 July",
    "text": "July Days: A spontaneous pro-soviet demonstration occurred on the streets of Petrograd."
  },
  {
    "year": 1917,
    "day": "6 July",
    "text": "July Days: The rebellion was put down. The Provisional Government ordered the arrest of Bolshevik leaders."
  },
  {
    "year": 1917,
    "day": "14 July",
    "text": "The Maapäev took office."
  },
  {
    "year": 1917,
    "day": "21 July",
    "text": "Alexander Kerensky succeeded L'vov as Prime Minister."
  },
  {
    "year": 1917,
    "day": "27 August",
    "text": "Kornilov Affair: General Lavr Kornilov ordered an army corps to Petrograd to destroy the soviets."
  },
  {
    "year": 1917,
    "day": "29 August",
    "text": "Kornilov Affair: The Provisional Government armed tens of thousands of Red Guards to defend Petrograd."
  },
  {
    "year": 1917,
    "day": "31 August",
    "text": "Kornilov Affair: Kornilov was arrested."
  },
  {
    "year": 1917,
    "day": "4 September",
    "text": "Under public pressure, Bolshevik leaders were released from prison."
  },
  {
    "year": 1917,
    "day": "23 October",
    "text": "Estonian Bolsheviks under Jaan Anvelt captured the capital, Tallinn."
  },
  {
    "year": 1917,
    "day": "25 October",
    "text": "October Revolution: Soldiers directed by the Military Revolutionary Committee of the Petrograd Soviet captured the Winter Palace, ending the power of the Russian Provisional Government."
  },
  {
    "year": 1917,
    "day": "25 October",
    "text": "The Second All-Russian Congress of Soviets convened. Menshevik and moderate SR representatives walked out to protest the October Revolution. The Congress established and elected the Sovnarkom, and Lenin its first chairman, to run the country between sessions."
  },
  {
    "year": 1917,
    "day": "26 October",
    "text": "The Second All-Russian Congress of Soviets issued the Decree on Peace, promising an end to Russian participation in World War I, and the Decree on Land, approving the expropriation of land from the nobility."
  },
  {
    "year": 1917,
    "day": "21 November",
    "text": "The Moldavian legislature, the Sfatul Țării, held its first meeting."
  },
  {
    "year": 1917,
    "day": "5 December",
    "text": "A local nationalist group, the Alash Orda, established an autonomous government in Kazakhstan."
  },
  {
    "year": 1917,
    "day": "6 December",
    "text": "The Finnish parliament issued a declaration of independence."
  },
  {
    "year": 1917,
    "day": "7 December",
    "text": "The Cheka was established."
  },
  {
    "year": 1917,
    "day": "12 December",
    "text": "A Muslim republic, the Idel-Ural State, was established in central Russia."
  },
  {
    "year": 1917,
    "day": "25 December",
    "text": "Ukrainian Bolsheviks established the Soviet Ukrainian Republic in Kharkiv."
  },
  {
    "year": 1917,
    "day": "27 December",
    "text": "Russian Civil War: The counterrevolutionary Volunteer Army was established."
  },
  {
    "year": 1918,
    "day": "12 January",
    "text": "The Tsentralna Rada declared the independence of the Ukrainian People's Republic."
  },
  {
    "year": 1918,
    "day": "14 January",
    "text": "The Rumcherod declared itself the supreme power in Bessarabia."
  },
  {
    "year": 1918,
    "day": "15 January",
    "text": "A decree of the Sovnarkom established the Red Army."
  },
  {
    "year": 1918,
    "day": "16 January",
    "text": "The Romanian army occupied Kishinev and evicted the Rumcherod."
  },
  {
    "year": 1918,
    "day": "24 January",
    "text": "The Moldavian Democratic Republic declared its independence from Russia."
  },
  {
    "year": 1918,
    "day": "28 January",
    "text": "The Transcaucasian parliament held its first meeting."
  },
  {
    "year": 1918,
    "day": "18 February",
    "text": "The Red Army conquered Kiev."
  },
  {
    "year": 1918,
    "day": "23 February",
    "text": "Mass conscription to the Red Army began in Moscow and Petrograd."
  },
  {
    "year": 1918,
    "day": "24 February",
    "text": "The Red Army retreated from Estonia in the face of the German armed forces."
  },
  {
    "year": 1918,
    "day": "24 February",
    "text": "The Transcaucasian parliament announced the independent Transcaucasian Democratic Federative Republic (TDFR)."
  },
  {
    "year": 1918,
    "day": "3 March",
    "text": "Soviet Russia signed the Treaty of Brest-Litovsk, ending its participation in World War I, relinquishing Finland, Estonia, Latvia, Lithuania, Poland, Belarus, and Ukraine, and ceding to the Ottoman Empire all territory captured in the Russo-Turkish War."
  },
  {
    "year": 1918,
    "day": "6 March",
    "text": "Allied intervention in the Russian Civil War: Two hundred British marines arrived at Murmansk."
  },
  {
    "year": 1918,
    "day": "25 March",
    "text": "The Belarusian National Republic was established by its German occupiers."
  },
  {
    "year": 1918,
    "day": "April",
    "text": "The Idel-Ural State was occupied and dissolved by the Red Army."
  },
  {
    "year": 1918,
    "day": "30 April",
    "text": "The Turkestan Autonomous Soviet Socialist Republic (ASSR) was established on the territory of the defunct Russian Turkestan."
  },
  {
    "year": 1918,
    "day": "26 May",
    "text": "Russian Civil War: The Czecho-Slovak Legions began its revolt against the Bolshevik government."
  },
  {
    "year": 1918,
    "day": "26 May",
    "text": "Georgia seceded from the TDFR."
  },
  {
    "year": 1918,
    "day": "28 May",
    "text": "Armenia and Azerbaijan declared their mutual independence."
  },
  {
    "year": 1918,
    "day": "8 June",
    "text": "Russian Civil War: An anti-Bolshevik government, the Committee of Members of the Constituent Assembly, was established in Samara under the protection of the Czecho-Slovak Legions"
  },
  {
    "year": 1918,
    "day": "28 June",
    "text": "A decree by the Central Executive Committee made war communism, under which all industry and food distribution was nationalized, the economic policy of the Soviet state."
  },
  {
    "year": 1918,
    "day": "29 June",
    "text": "Russian Civil War: The Provisional Government of Autonomous Siberia was established in Vladivostok."
  },
  {
    "year": 1918,
    "day": "July",
    "text": "The Idel-Ural State was restored by the Czecho-Slovak Legions."
  },
  {
    "year": 1918,
    "day": "July",
    "text": "Makhno declared his opposition to the Hetmanate regime by some operations in the southeastern Ukraine."
  },
  {
    "year": 1918,
    "day": "10 July",
    "text": "The Russian Constitution of 1918 was adopted by the Fifth All-Russian Congress of Soviets. The legislative power was transferred from the Sovnarkom to the Central Executive Committee, which also received the power to pass constitutional amendments."
  },
  {
    "year": 1918,
    "day": "17 July",
    "text": "Nicholas and the rest of the royal family were executed on direct orders from Lenin."
  },
  {
    "year": 1918,
    "day": "30 August",
    "text": "After giving a speech at a Moscow factory, Lenin was shot twice by SR Fanny Kaplan, but survived."
  },
  {
    "year": 1918,
    "day": "3 September",
    "text": "Red Terror: Izvestia called on the Russian people to \"crush the hydra of counterrevolution with massive terror."
  },
  {
    "year": 1918,
    "day": "23 September",
    "text": "Russian Civil War: A meeting in Ufa established a unified anti-Bolshevik government, the Ufa Directorate."
  },
  {
    "year": 1918,
    "day": "November",
    "text": "Makhnovists established an anarchist society run by peasants and workers in Ukraine, in the territory of Berdyansk, Donetsk, Alexandrovsk and Yekaterinoslav."
  },
  {
    "year": 1918,
    "day": "11 November",
    "text": "World War I: An armistice treaty was signed, ending the war."
  },
  {
    "year": 1918,
    "day": "17 November",
    "text": "Two Latvian political parties founded a provisional legislature, the Tautas Padome."
  },
  {
    "year": 1918,
    "day": "18 November",
    "text": "A military coup overthrew the Ufa Directorate and established its war minister, Aleksandr Kolchak, as dictator."
  },
  {
    "year": 1918,
    "day": "19 November",
    "text": "The Maapäev returned to power in Estonia."
  },
  {
    "year": 1918,
    "day": "22 November",
    "text": "Estonian War of Independence: The Russian Red Army invaded Estonia."
  },
  {
    "year": 1918,
    "day": "24 November",
    "text": "Béla Kun, a friend of Lenin, founded the Hungarian Communist Party."
  },
  {
    "year": 1918,
    "day": "29 November",
    "text": "Estonian War of Independence: The Red Army captured the Estonian town of Narva. Local Bolsheviks reestablished the Anvelt government as the Commune of the Working People of Estonia."
  },
  {
    "year": 1918,
    "day": "December",
    "text": "The Idel-Ural State was again occupied and dissolved by the Red Army."
  },
  {
    "year": 1918,
    "day": "8 December",
    "text": "The Communist Party of Lithuania established a revolutionary government in Vilnius."
  },
  {
    "year": 1919,
    "day": "1 January",
    "text": "Local Bolsheviks established the Byelorussian Soviet Socialist Republic (SSR)."
  },
  {
    "year": 1919,
    "day": "3 January",
    "text": "Latvian War of Independence: The Red Army invaded Latvia."
  },
  {
    "year": 1919,
    "day": "5 January",
    "text": "The Red Army occupied Vilnius, the Lithuanian capital, in support of the local Communist government."
  },
  {
    "year": 1919,
    "day": "5 January",
    "text": "The Red Army captured Minsk and pronounced it the capital of the Byelorussian SSR."
  },
  {
    "year": 1919,
    "day": "16 January",
    "text": "The Orgburo was established to oversee the membership and organization of the Communist Party."
  },
  {
    "year": 1919,
    "day": "14 February",
    "text": "Polish–Soviet War: The Polish army attacked Soviet forces occupying the town of Biaroza."
  },
  {
    "year": 1919,
    "day": "27 February",
    "text": "Lithuania was absorbed into the Lithuanian-Byelorussian Soviet Socialist Republic."
  },
  {
    "year": 1919,
    "day": "4 March",
    "text": "The First Congress of the Comintern began in Moscow."
  },
  {
    "year": 1919,
    "day": "21 March",
    "text": "Seeking a military alliance with Russia against the French, the Hungarian Social Democrats merged with the Communist Party, released Kun from prison and appointed him Commissar for Foreign Affairs. Kun dismissed the president and proclaimed the Hungarian Soviet Republic."
  },
  {
    "year": 1919,
    "day": "25 March",
    "text": "The Eighth Party Congress reinstituted the Politburo as the central governing body of the Communist Party."
  },
  {
    "year": 1919,
    "day": "16 April",
    "text": "The Romanian army invaded Hungary."
  },
  {
    "year": 1919,
    "day": "21 April",
    "text": "Polish–Soviet War: The Polish army consolidated its control of Vilnius."
  },
  {
    "year": 1919,
    "day": "30 May",
    "text": "An anti-Communist Hungarian government headed by Gyula Károlyi was established in Szeged."
  },
  {
    "year": 1919,
    "day": "16 June",
    "text": "Hungarian occupiers established the Slovak Soviet Republic."
  },
  {
    "year": 1919,
    "day": "7 July",
    "text": "The Czechoslovak army reoccupied its territory and dissolved the Slovak Soviet Republic."
  },
  {
    "year": 1919,
    "day": "1 August",
    "text": "Threatened by the approach of the Romanian army, Kun fled to Austria."
  },
  {
    "year": 1919,
    "day": "14 August",
    "text": "The Romanian army left the Hungarian capital, Budapest. Admiral Miklós Horthy stepped into the power vacuum with the army of the Károlyi government."
  },
  {
    "year": 1919,
    "day": "25 August",
    "text": "Polish–Soviet War: After its total occupation by Polish forces, the Lithuanian-Byelorussian SSR was dissolved."
  },
  {
    "year": 1920,
    "day": "2 February",
    "text": "Estonian War of Independence: Soviet Russia signed the Treaty of Tartu, renouncing all claims on Estonian territory."
  },
  {
    "year": 1920,
    "day": "2 February",
    "text": "An insurgency in the Khanate of Khiva forced the abdication of the Khan."
  },
  {
    "year": 1920,
    "day": "7 February",
    "text": "Russian Civil War: Kolchak was executed by a Bolshevik military tribunal."
  },
  {
    "year": 1920,
    "day": "February",
    "text": "The Free Territory was inundated with Red troops, including the 42nd Rifle Division and the Latvian & Estonian Red Division – in total at least 20,000 soldiers. The insurgents disarmed the 10,000-strong Estonian Division in Huliajpole."
  },
  {
    "year": 1920,
    "day": "26 March",
    "text": "Russian Civil War: The Volunteer Army evacuated to the Crimea to join the army of Pyotr Nikolayevich Wrangel."
  },
  {
    "year": 1920,
    "day": "25 April",
    "text": "The Russian Eleventh Army invaded the Azerbaijan Democratic Republic."
  },
  {
    "year": 1920,
    "day": "26 April",
    "text": "The Khorezm People's Soviet Republic was established on the territory of the defunct Khanate of Khiva."
  },
  {
    "year": 1920,
    "day": "28 April",
    "text": "With the Azerbaijani capital Baku under Eleventh Army occupation, the parliament agreed to transfer power to the Communist government of the Azerbaijan SSR."
  },
  {
    "year": 1920,
    "day": "12 June",
    "text": "The Soviet Union recognized Lithuanian independence."
  },
  {
    "year": 1920,
    "day": "8 July",
    "text": "Polish–Soviet War: The Galician Soviet Socialist Republic (SSR) was established in Ternopil."
  },
  {
    "year": 1920,
    "day": "11 August",
    "text": "Latvian War of Independence: The Treaty of Riga was signed. Soviet Russia renounced all claims on Latvian territory."
  },
  {
    "year": 1920,
    "day": "13 August",
    "text": "Battle of Warsaw: The battle began with a Russian attack across the Vistula."
  },
  {
    "year": 1920,
    "day": "26 August",
    "text": "The Bolsheviks defeated the government of the Alash Orda and established the Kyrgyz ASSR† (1)."
  },
  {
    "year": 1920,
    "day": "31 August",
    "text": "Battle of Warsaw: The total defeat of the Russian Fourth, Fifteenth and Sixteenth Armies marked the end of the battle."
  },
  {
    "year": 1920,
    "day": "2 September",
    "text": "The Red Army attacked Bukhara, the capital of the Emirate of Bukhara."
  },
  {
    "year": 1920,
    "day": "21 September",
    "text": "Polish–Soviet War: The Polish army occupied Galicia and ended the rule of the Galician SSR."
  },
  {
    "year": 1920,
    "day": "25 September",
    "text": "Makhno's Black Army suddenly turned from south to east, attacking the main forces of General Denikin's army."
  },
  {
    "year": 1920,
    "day": "26 September",
    "text": "Makhnovists routed elements of the white Volunteer Army in the Battle of Peregonovka, Uman (Ukraine)."
  },
  {
    "year": 1920,
    "day": "8 October",
    "text": "The Bukharan People's Soviet Republic was established."
  },
  {
    "year": 1920,
    "day": "14 November",
    "text": "Russian Civil War: Wrangel fled Russia."
  },
  {
    "year": 1920,
    "day": "29 November",
    "text": "The Eleventh Army entered Armenia."
  },
  {
    "year": 1920,
    "day": "1 December",
    "text": "The Armenian Prime Minister ceded control of the country to the invading Communists."
  },
  {
    "year": 1921,
    "day": "16 February",
    "text": "Red Army invasion of Georgia: The Eleventh Army crossed into Georgia."
  },
  {
    "year": 1921,
    "day": "22 February",
    "text": "Gosplan, the economic planning committee of the Soviet Union, was created by a decree of the Sovnarkom."
  },
  {
    "year": 1921,
    "day": "25 February",
    "text": "Red Army invasion of Georgia: The Eleventh Army captured Tbilisi and announced the formation of the Georgian SSR."
  },
  {
    "year": 1921,
    "day": "28 February",
    "text": "Kronstadt rebellion: The crews of the battleships Petropavlovsk and Sevastopol, harbored at Kronstadt, published a list of demands on the government."
  },
  {
    "year": 1921,
    "day": "17 March",
    "text": "Kronstadt rebellion: After over a week of fighting, government troops pacified Kronstadt."
  },
  {
    "year": 1921,
    "day": "21 March",
    "text": "A decree of the Tenth Party Congress replaced war communism with the more liberal New Economic Policy."
  },
  {
    "year": 1921,
    "day": "18 March",
    "text": "Polish–Soviet War: Poland and Soviet Russia signed the Peace of Riga, ending the war. The disputed territories were divided between Poland, Russia and the newly reestablished Ukrainian and Byelorussian SSRs."
  },
  {
    "year": 1921,
    "day": "July",
    "text": "The Red Army captured Ulan Bator, the Mongolian capital."
  },
  {
    "year": 1921,
    "day": "13 July",
    "text": "Russian famine of 1921: The writer Maxim Gorky brought world attention to the looming famine."
  },
  {
    "year": 1921,
    "day": "August",
    "text": "Nestor Makhno's headquarters staff and several Black Army subordinate commanders were arrested and executed on the spot by a Red Army firing squad: the Makhnovist treaty delegation, still in Kharkiv, was also arrested and liquidated. Makhno's Black Army forces were defeated and dispersed by Red Army."
  },
  {
    "year": 1922,
    "day": "23 February",
    "text": "Russian famine of 1921: A decree published in Izvestia authorized the seizure of church valuables for famine relief."
  },
  {
    "year": 1922,
    "day": "12 March",
    "text": "The Georgian, Armenian and Azerbaijani SSRs were merged into the Transcaucasian Soviet Federative Socialist Republic (SFSR)."
  },
  {
    "year": 1922,
    "day": "3 April",
    "text": "The Eleventh Communist Party Congress established the office of the General Secretary of the Communist Party and appointed Joseph Stalin to fill it."
  },
  {
    "year": 1922,
    "day": "16 May",
    "text": "Tikhon, the Patriarch of Moscow, was put under house arrest."
  },
  {
    "year": 1922,
    "day": "4 August",
    "text": "Basmachi Revolt: Enver Pasha was killed in Turkestan."
  },
  {
    "year": 1922,
    "day": "29 December",
    "text": "The Treaty on the Creation of the USSR united its signatories, the Russian and Transcaucasian SFSRs and the Byelorussian and Ukrainian SSRs, under the power of the Union of Soviet Socialist Republics."
  },
  {
    "year": 1923,
    "day": "3 May",
    "text": "A council of the pro-government Living Church declared Tikhon an apostate and abolished the Patriarchate."
  },
  {
    "year": 1923,
    "day": "15 October",
    "text": "The Declaration of 46 was written. The Declaration echoed earlier concerns expressed by Leon Trotsky, the Chairman of the Revolutionary Military Council, that the Communist Party was insufficiently democratic."
  },
  {
    "year": 1924,
    "day": "21 January",
    "text": "Lenin died."
  },
  {
    "year": 1924,
    "day": "31 January",
    "text": "The 1924 Soviet Constitution came into effect."
  },
  {
    "year": 1924,
    "day": "18 February",
    "text": "The Thirteenth Party Congress, led by Stalin, Comintern chairman Grigory Zinoviev and Politburo chairman Lev Kamenev, denounced Trotsky and his faction, the Left Opposition."
  },
  {
    "year": 1924,
    "day": "10 October",
    "text": "The territory of the Khorezm SSR was incorporated into the Turkestan ASSR."
  },
  {
    "year": 1924,
    "day": "12 October",
    "text": "The Moldavian ASSR was established in the Ukrainian SSR."
  },
  {
    "year": 1924,
    "day": "14 October",
    "text": "The Kara-Kyrgyz Autonomous Oblast was spun off of the Turkestan ASSR and incorporated into the Russian SFSR."
  },
  {
    "year": 1924,
    "day": "27 October",
    "text": "The Uzbek SSR was spun out of the Turkestan ASSR."
  },
  {
    "year": 1924,
    "day": "25 November",
    "text": "The Mongolian People's Republic was established."
  },
  {
    "year": 1924,
    "day": "27 November",
    "text": "The Bukharan People's Soviet Republic was incorporated into the Uzbek SSR."
  },
  {
    "year": 1925,
    "day": "6 January",
    "text": "Trotsky was forced to resign his military offices."
  },
  {
    "year": 1925,
    "day": "19 February",
    "text": "The lands of the Karakalpaks became the Karakalpak Autonomous Oblast, an oblast of the Kyrgyz ASSR (1)."
  },
  {
    "year": 1925,
    "day": "7 April",
    "text": "Tikhon died. The Communist government would not allow elections to the patriarchate to be held; Metropolitan Peter of Krutitsy became the Patriarchal locum tenens according to his will."
  },
  {
    "year": 1925,
    "day": "19 April",
    "text": "The Kyrgyz ASSR (1) was renamed the Kazakh ASSR."
  },
  {
    "year": 1925,
    "day": "13 May",
    "text": "The Uzbek SSR joined the Soviet Union."
  },
  {
    "year": 1925,
    "day": "13 May",
    "text": "The remainder of the Turkestan ASSR became the Turkmen SSR."
  },
  {
    "year": 1925,
    "day": "10 December",
    "text": "Peter of Krutitsy was arrested. Sergius of Nizhny Novgorod, whom he had named to succeed him, took the title of Deputy Patriarchal locum tenens."
  },
  {
    "year": 1925,
    "day": "23 December",
    "text": "The Fourteenth Party Congress endorsed the leadership of Stalin and his rightist ally Nikolai Bukharin, soundly defeating the New Opposition faction of Kamenev and Zinoviev."
  },
  {
    "year": 1926,
    "day": "11 February",
    "text": "The Kara-Kyrgyz Autonomous Oblast was reorganized into the Kyrgyz ASSR (2)."
  },
  {
    "year": 1926,
    "day": "23 October",
    "text": "Trotsky was expelled from the Politburo."
  },
  {
    "year": 1927,
    "day": "25 February",
    "text": "Article 58 of the RFSR Penal Code revised the penalties for counterrevolutionary activity."
  },
  {
    "year": 1927,
    "day": "29 July",
    "text": "Sergius affirmed the loyalty of the Russian Orthodox Church to the Soviet government."
  },
  {
    "year": 1927,
    "day": "12 November",
    "text": "Trotsky and Zinoviev were expelled from the Communist Party."
  },
  {
    "year": 1927,
    "day": "2 December",
    "text": "The Fifteenth Party Congress expelled the remainder of the United Opposition from the Party."
  },
  {
    "year": 1928,
    "day": "7 March",
    "text": "Shakhty Trial: Police arrested a group of engineers in the town of Shakhty and accused them of conspiring to sabotage the Soviet economy."
  },
  {
    "year": 1928,
    "day": "1 October",
    "text": "First five-year plan: Stalin announced the beginning of state industrialisation of the Soviet economy."
  },
  {
    "year": 1929,
    "day": "17 November",
    "text": "Bukharin was expelled from the Politburo."
  },
  {
    "year": 1929,
    "day": "17 November",
    "text": "Collectivisation in the USSR: A Central Committee resolution began the collectivisation of Soviet agriculture."
  },
  {
    "year": 1929,
    "day": "5 December",
    "text": "The Tajik ASSR of the Uzbek SSR became the Tajik SSR."
  },
  {
    "year": 1930,
    "day": "15 April",
    "text": "The Gulag was officially established."
  },
  {
    "year": 1930,
    "day": "20 July",
    "text": "The Karakalpak Autonomous Oblast was transferred to the Russian SFSR."
  },
  {
    "year": 1932,
    "day": "20 March",
    "text": "The Karakalpak Autonomous Oblast became the Karakalpak ASSR."
  },
  {
    "year": 1932,
    "day": "7 August",
    "text": "Collectivisation in the USSR: The Central Executive Committee and the Sovnarkom issued the Decree about the Protection of Socialist Property, under which any theft of public property was punishable by death."
  },
  {
    "year": 1932,
    "day": "11 September",
    "text": "Holodomor: Stalin sent a letter to a Politburo ally, Lazar Kaganovich, demanding the subjection of the Ukrainian SSR."
  },
  {
    "year": 1932,
    "day": "27 December",
    "text": "A decree by the Central Executive Committee and the Sovnarkom established a passport system in the Soviet Union."
  },
  {
    "year": 1932,
    "day": "31 December",
    "text": "First Five-Year Plan: It was announced that the plan had been fulfilled."
  },
  {
    "year": 1933,
    "day": "22 January",
    "text": "Holodomor: Police were instructed to prevent Ukrainian peasants from leaving their homes in search of food."
  },
  {
    "year": 1934,
    "day": "8 February",
    "text": "Elections to the Central Committee at the Seventeenth Party Congress revealed Sergey Kirov, the chief of the Leningrad Party, to be the most popular member."
  },
  {
    "year": 1934,
    "day": "10 July",
    "text": "The Main Directorate of State Security (GUGB) was established under the NKVD as a successor to the OGPU."
  },
  {
    "year": 1934,
    "day": "1 December",
    "text": "Kirov was murdered by Leonid Nikolaev, possibly at the behest of Stalin."
  },
  {
    "year": 1935,
    "day": "31 August",
    "text": "Aleksei Grigorievich Stakhanov was reported to have mined over one hundred tons of coal in a single shift, sowing the seeds of the Stakhanovite movement."
  },
  {
    "year": 1936,
    "day": "19 August",
    "text": "Moscow Trials: The Trial of the Sixteen, in which Kamenev and Grigory Zinoviev were the primary defendants, began."
  },
  {
    "year": 1936,
    "day": "25 August",
    "text": "Moscow Trials: The defendants in the Trial of the Sixteen were executed."
  },
  {
    "year": 1936,
    "day": "5 December",
    "text": "The Stalin Constitution came into effect. The Central Executive Committee was renamed the Supreme Soviet of the Soviet Union."
  },
  {
    "year": 1936,
    "day": "5 December",
    "text": "The Kyrgyz ASSR (2) became a Union-level republic, the Kyrgyz SSR."
  },
  {
    "year": 1936,
    "day": "5 December",
    "text": "The Kazakh ASSR became the Kazakh SSR."
  },
  {
    "year": 1936,
    "day": "5 December",
    "text": "The territory of the Karakalpak ASSR was incorporated into the Uzbek SSR."
  },
  {
    "year": 1937,
    "day": "23 January",
    "text": "Moscow Trials: The Second Trial began."
  },
  {
    "year": 1937,
    "day": "30 January",
    "text": "Moscow Trials: The Second Trial ended. Of seventeen defendants, all but four were sentenced to death."
  },
  {
    "year": 1937,
    "day": "22 May",
    "text": "Case of Trotskyist Anti-Soviet Military Organization: Mikhail Tukhachevsky, a Marshal of the Soviet Union and hero of the Russian Civil War, was arrested."
  },
  {
    "year": 1937,
    "day": "12 June",
    "text": "Case of Trotskyist Anti-Soviet Military Organization: Tukhachevsky was executed, with eight other military leaders."
  },
  {
    "year": 1937,
    "day": "30 July",
    "text": "Great Purge: NKVD Order № 00447 was issued. The order established a new judicial method, the NKVD troika, and set nationwide quotas for the execution and enslavement of \"anti-Soviet elements."
  },
  {
    "year": 1937,
    "day": "11 August",
    "text": "Polish operation of the NKVD: The NKVD chief signed Order № 00485, classifying all potential Polish nationalists as enemies of the state."
  },
  {
    "year": 1937,
    "day": "15 August",
    "text": "Great Purge: NKVD Order № 00486 made relatives of accused traitors subject to imprisonment in labor camps."
  },
  {
    "year": 1937,
    "day": "10 October",
    "text": "Peter of Krutitsy was executed in solitary confinement."
  },
  {
    "year": 1938,
    "day": "",
    "text": "A new decree required the teaching of Russian in all non-Russian schools."
  },
  {
    "year": 1938,
    "day": "2 March",
    "text": "Trial of the Twenty One: The third Moscow Trial, at which Bukharin was the primary defendant, began."
  },
  {
    "year": 1938,
    "day": "15 March",
    "text": "Trial of the Twenty One: The defendants were executed."
  },
  {
    "year": 1938,
    "day": "29 July",
    "text": "Battle of Lake Khasan: The armed forces of Japanese Manchukuo attacked the Soviet military at Lake Khasan."
  },
  {
    "year": 1938,
    "day": "31 August",
    "text": "Battle of Lake Khasan: The battle ended in a Japanese defeat."
  },
  {
    "year": 1939,
    "day": "23 August",
    "text": "The Molotov–Ribbentrop Pact was signed, promising mutual non-aggression between Germany and the Soviet Union and agreeing to a division of much of Europe between those two countries."
  },
  {
    "year": 1939,
    "day": "17 September",
    "text": "Soviet invasion of Poland: The Red Army invaded Poland."
  },
  {
    "year": 1939,
    "day": "22 October",
    "text": "Elections were held to the Supreme Soviets of the Polish areas annexed by the Soviet Union."
  },
  {
    "year": 1939,
    "day": "26 November",
    "text": "Shelling of Mainila: The Red Army shelled the Russian village of Mainila and blamed the Finns for invented casualties."
  },
  {
    "year": 1939,
    "day": "30 November",
    "text": "Winter War: The Soviet army attacked Finland."
  },
  {
    "year": 1939,
    "day": "1 December",
    "text": "Winter War: The Soviet Union established the Finnish Democratic Republic in the border town of Terijoki."
  },
  {
    "year": 1940,
    "day": "5 March",
    "text": "Katyn massacre: The Politburo signed an order to execute 27,500 imprisoned Polish nationals."
  },
  {
    "year": 1940,
    "day": "12 March",
    "text": "Winter War: The Moscow Peace Treaty was signed, ending the war at great cost to Finland and anticipating the evacuation of Finnish Karelia."
  },
  {
    "year": 1940,
    "day": "31 March",
    "text": "The Karelian ASSR merged with the Finnish Democratic Republic into the Karelo-Finnish SSR."
  },
  {
    "year": 1940,
    "day": "15 June",
    "text": "The Red Army occupied Lithuania."
  },
  {
    "year": 1940,
    "day": "17 June",
    "text": "The Red Army occupied Estonia and Latvia."
  },
  {
    "year": 1940,
    "day": "28 June",
    "text": "Soviet occupation of Bessarabia: Bessarabia and northern Bukovina were occupied by the Soviet Union."
  },
  {
    "year": 1940,
    "day": "21 July",
    "text": "Lithuania became the Lithuanian SSR; Latvia became the Latvian SSR."
  },
  {
    "year": 1940,
    "day": "2 August",
    "text": "The Moldavian ASSR became the Moldavian SSR, with much of its territory on the former Bessarabia and Bukovina. The old territory of the Moldavian ASSR remained in the Ukrainian SSR."
  },
  {
    "year": 1940,
    "day": "3 August",
    "text": "The Lithuanian SSR was accepted into the Soviet Union."
  },
  {
    "year": 1940,
    "day": "5 August",
    "text": "The Latvian SSR was annexed by the Soviet Union."
  },
  {
    "year": 1940,
    "day": "6 August",
    "text": "Estonia became the Estonian SSR and was incorporated into the Soviet Union."
  },
  {
    "year": 1940,
    "day": "21 August",
    "text": "Trotsky is assassinated by Ramon Mercador on Stalin's orders."
  },
  {
    "year": 1941,
    "day": "13 April",
    "text": "Soviet-Japanese Border Wars: A Soviet-Japanese Neutrality Pact was signed."
  },
  {
    "year": 1941,
    "day": "22 June",
    "text": "Operation Barbarossa: Three million Axis soldiers invaded the Soviet Union."
  },
  {
    "year": 1941,
    "day": "22 June",
    "text": "Lithuanian 1941 independence: The Lithuanian Activist Front (LAF) began an uprising against the Soviet government."
  },
  {
    "year": 1941,
    "day": "24 June",
    "text": "Lithuanian 1941 independence: The LAF government took power in Lithuania."
  },
  {
    "year": 1941,
    "day": "25 June",
    "text": "Continuation War: The Soviet Union launched a major air offensive against Finnish targets."
  },
  {
    "year": 1941,
    "day": "28 June",
    "text": "Operation Barbarossa: The Germans captured Minsk."
  },
  {
    "year": 1941,
    "day": "27 July",
    "text": "Operation Barbarossa: The German and Romanian armies entered Kishinev."
  },
  {
    "year": 1941,
    "day": "21 August",
    "text": "Anglo-Soviet invasion of Iran: Three Soviet armies invaded Iran from the north."
  },
  {
    "year": 1941,
    "day": "8 September",
    "text": "Siege of Leningrad: The German army cut the last land tie to Leningrad."
  },
  {
    "year": 1941,
    "day": "17 September",
    "text": "Anglo-Soviet invasion of Iran: The Soviet and British armed forces met in Tehran."
  },
  {
    "year": 1941,
    "day": "19 September",
    "text": "Operation Barbarossa: Kiev fell to the Germans."
  },
  {
    "year": 1941,
    "day": "2 October",
    "text": "Battle of Moscow: Three German armies began an advance on Moscow."
  },
  {
    "year": 1941,
    "day": "20 November",
    "text": "Siege of Leningrad: The first food was carried into Leningrad across the Road of Life on the frozen Lake Ladoga."
  },
  {
    "year": 1941,
    "day": "5 December",
    "text": "Battle of Moscow: The Soviet army launched a counterattack from Kalinin."
  },
  {
    "year": 1942,
    "day": "7 January",
    "text": "Battle of Moscow: The Soviet counteroffensive ended between sixty and one-hundred fifty miles from Moscow."
  },
  {
    "year": 1942,
    "day": "21 August",
    "text": "Battle of Stalingrad: The German Luftwaffe began a bombing raid against Stalingrad."
  },
  {
    "year": 1942,
    "day": "19 November",
    "text": "Operation Uranus: The Soviet army began a pincer movement against the German forces besieging Stalingrad."
  },
  {
    "year": 1942,
    "day": "22 November",
    "text": "Operation Uranus: The German Sixth Army was surrounded."
  },
  {
    "year": 1943,
    "day": "12 January",
    "text": "Operation Spark (1943): The Soviet army launched a military offensive to break the Siege of Leningrad."
  },
  {
    "year": 1943,
    "day": "18 January",
    "text": "Operation Spark (1943): The meeting of the Leningrad and Volkhov Front units opened a land corridor to Leningrad."
  },
  {
    "year": 1943,
    "day": "2 February",
    "text": "Battle of Stalingrad: The German Sixth Army surrendered."
  },
  {
    "year": 1943,
    "day": "15 May",
    "text": "The Comintern was dissolved."
  },
  {
    "year": 1943,
    "day": "8 September",
    "text": "Stalin allowed a church council, which unanimously elected Sergius to the Patriarchate of Moscow."
  },
  {
    "year": 1943,
    "day": "6 November",
    "text": "The Russians recaptured Kiev."
  },
  {
    "year": 1944,
    "day": "6 January",
    "text": "The Red Army crossed into Poland."
  },
  {
    "year": 1944,
    "day": "27 January",
    "text": "Siege of Leningrad: The last German forces were expelled from the city."
  },
  {
    "year": 1944,
    "day": "15 May",
    "text": "Sergius died."
  },
  {
    "year": 1944,
    "day": "21 July",
    "text": "The Communist Lublin Government of Poland was established."
  },
  {
    "year": 1944,
    "day": "1 August",
    "text": "Warsaw Uprising: The Polish Home Army began an attack on German forces in Warsaw."
  },
  {
    "year": 1944,
    "day": "22 August",
    "text": "Warsaw Uprising: Stalin denied the Allies use of his landing strips to supply aid to the insurgents."
  },
  {
    "year": 1944,
    "day": "23 August",
    "text": "Michael I of Romania led a coup against the military dictatorship of Ion Antonescu."
  },
  {
    "year": 1944,
    "day": "31 August",
    "text": "Soviet occupation of Romania: The Red Army captured Bucharest."
  },
  {
    "year": 1944,
    "day": "12 September",
    "text": "Romania signed an armistice with the Allies, placing itself under the command of an Allied Commission led by Marshal of the Soviet Union Rodion Malinovsky."
  },
  {
    "year": 1944,
    "day": "19 September",
    "text": "Continuation War: The Moscow Armistice was signed, ending the war at roughly the prewar borders."
  },
  {
    "year": 1944,
    "day": "21 September",
    "text": "Soviet and Czechoslovak partisan armed forces entered German-occupied Czechoslovakia."
  },
  {
    "year": 1944,
    "day": "2 October",
    "text": "Warsaw Uprising: The leader of the Uprising signed a surrender agreement."
  },
  {
    "year": 1944,
    "day": "14 November",
    "text": "The Committee for the Liberation of the Peoples of Russia was established in Prague."
  },
  {
    "year": 1944,
    "day": "31 December",
    "text": "The Provisional Government of the Republic of Poland (RTRP), which incorporated token non-Communists into the preexisting Lublin Government, was established."
  },
  {
    "year": 1945,
    "day": "17 January",
    "text": "The Soviet Union captured Warsaw."
  },
  {
    "year": 1945,
    "day": "18 January",
    "text": "The Soviet Union captured Budapest."
  },
  {
    "year": 1945,
    "day": "2 February",
    "text": "Alexius I was elected Patriarch of Moscow."
  },
  {
    "year": 1945,
    "day": "11 February",
    "text": "The Soviet Union gained the right to Sakhalin and the Kuril Islands at the Yalta Conference"
  },
  {
    "year": 1945,
    "day": "6 March",
    "text": "Romanian Prime Minister Nicolae Rădescu was forced to resign his office to Petru Groza of the Ploughmen's Front."
  },
  {
    "year": 1945,
    "day": "4 April",
    "text": "The government of the Third Czechoslovakian Republic was established in Košice."
  },
  {
    "year": 1945,
    "day": "20 April",
    "text": "Battle of Berlin: The Soviet army began shelling Berlin."
  },
  {
    "year": 1945,
    "day": "21 April",
    "text": "The RTRP ceded control of Poland's internal security apparatus to the Soviet government for forty years."
  },
  {
    "year": 1945,
    "day": "2 May",
    "text": "Battle of Berlin: The defenders of Berlin surrendered to the Soviet Union."
  },
  {
    "year": 1945,
    "day": "9 May",
    "text": "The Soviet army captured Prague."
  },
  {
    "year": 1945,
    "day": "18 June",
    "text": "Trial of the Sixteen: Leaders of the Polish Secret State were tried in the Soviet Union for collaboration."
  },
  {
    "year": 1945,
    "day": "21 June",
    "text": "Trial of the Sixteen: The defendants were sentenced."
  },
  {
    "year": 1945,
    "day": "28 June",
    "text": "The coalition Provisional Government of National Unity (TRJN) was established in Poland."
  },
  {
    "year": 1945,
    "day": "5 July",
    "text": "The United States recognized the TRJN."
  },
  {
    "year": 1945,
    "day": "2 August",
    "text": "The Potsdam Agreement moved Poland's borders to the west and established the shape of occupied Germany."
  },
  {
    "year": 1945,
    "day": "16 August",
    "text": "Invasion of Manchuria: Soviet armed forces landed on Sakhalin."
  },
  {
    "year": 1945,
    "day": "18 August",
    "text": "Invasion of Manchuria: Soviet amphibious forces landed in Korea."
  },
  {
    "year": 1945,
    "day": "20 August",
    "text": "Invasion of Manchuria: The Soviet Union captured Changchun, the capital of Manchukuo."
  },
  {
    "year": 1945,
    "day": "25 August",
    "text": "Invasion of Manchuria: The Soviet Union captured Sakhalin's capital."
  },
  {
    "year": 1945,
    "day": "November",
    "text": "The Soviet Union established the Azerbaijan People's Government in Iranian Azerbaijan."
  },
  {
    "year": 1946,
    "day": "22 January",
    "text": "The Soviet-backed Kurdish Republic of Mahabad declared its independence from Iran."
  },
  {
    "year": 1946,
    "day": "2 March",
    "text": "Iran crisis: British troops withdrew from Iran. The Soviet Union violated its prior agreement and remained."
  },
  {
    "year": 1946,
    "day": "10 March",
    "text": "The Ukrainian Greek Catholic Church was liquidated by a rump synod in L'viv and driven underground."
  },
  {
    "year": 1946,
    "day": "20 March",
    "text": "László Rajk of the Hungarian Communist Party became Minister of the Interior."
  },
  {
    "year": 1946,
    "day": "9 May",
    "text": "Iran crisis: The Soviet Union withdrew from Iran."
  },
  {
    "year": 1946,
    "day": "26 May",
    "text": "1946 Czechoslovak parliamentary election: The Communist Party of Czechoslovakia (KSČ) won a plurality of votes, enabling their takeover of the information and interior ministries."
  },
  {
    "year": 1946,
    "day": "19 November",
    "text": "1946 Romanian general election: Rigged elections gave a vast majority of seats in the Romanian legislature to the Romanian Communist Party and its allies."
  },
  {
    "year": 1946,
    "day": "11 December",
    "text": "Iran regained control over the territory of the Azerbaijan People's Government."
  },
  {
    "year": 1946,
    "day": "15 December",
    "text": "Iran conquered Mahabad."
  },
  {
    "year": 1947,
    "day": "19 January",
    "text": "1947 Polish legislative election: Rigged elections gave the Communist bloc 80 percent of the vote."
  },
  {
    "year": 1947,
    "day": "31 August",
    "text": "The Hungarian Communist Party won a plurality of seats in elections to the Hungarian legislature."
  },
  {
    "year": 1947,
    "day": "5 October",
    "text": "The Cominform was established in order to coordinate Communist parties under Soviet control."
  },
  {
    "year": 1947,
    "day": "27 November",
    "text": "A speech to the Central Committee of the KSČ by Chairman Klement Gottwald denounced \"reactionary forces\" and triggered the purge of non-Communists from the Czechoslovakian security forces."
  },
  {
    "year": 1947,
    "day": "30 December",
    "text": "King Michael I of Romania was forced to abdicate."
  },
  {
    "year": 1948,
    "day": "20 February",
    "text": "Non-Communist ministers resigned from the Czechoslovakian parliament in order to force an election."
  },
  {
    "year": 1948,
    "day": "21 February",
    "text": "The KSČ established the Workers' Militia, banned non-Communists from television broadcasts, and occupied the non-Communist ministries."
  },
  {
    "year": 1948,
    "day": "25 February",
    "text": "Czechoslovakian president Edvard Beneš accepted the resignations of the non-Communist ministers and replaced them according to the demands of the KSČ."
  },
  {
    "year": 1948,
    "day": "13 April",
    "text": "A new Romanian constitution declared Romania a People's Republic."
  },
  {
    "year": 1948,
    "day": "24 June",
    "text": "Berlin Blockade: The Soviet Union blocked rail and road access to West Berlin."
  },
  {
    "year": 1948,
    "day": "25 June",
    "text": "Berlin Blockade: The commander of the American occupation zone ordered an airlift of supplies into West Berlin."
  },
  {
    "year": 1948,
    "day": "28 June",
    "text": "Yugoslavia was expelled from the Cominform."
  },
  {
    "year": 1948,
    "day": "9 September",
    "text": "The Democratic People's Republic of Korea was established."
  },
  {
    "year": 1949,
    "day": "11 May",
    "text": "Berlin Blockade: The Soviets lifted the blockade."
  },
  {
    "year": 1949,
    "day": "18 August",
    "text": "A new Communist constitution came into force in Hungary."
  },
  {
    "year": 1949,
    "day": "29 August",
    "text": "Joe 1: The Soviet atomic bomb project culminated in a successful test detonation."
  },
  {
    "year": 1950,
    "day": "30 January",
    "text": "Korean War: Regarding a mass invasion of the South, Stalin wrote to his ambassador to North Korea: \"Tell him [Kim] that I am ready to help him in this matter."
  },
  {
    "year": 1950,
    "day": "25 June",
    "text": "Korean War: The North Korean army launched a 135,000 man surprise assault across the 38th parallel."
  },
  {
    "year": 1950,
    "day": "1 November",
    "text": "Korean War: Soviet-piloted MiG-15s first crossed the Yalu River and attacked American planes."
  },
  {
    "year": 1952,
    "day": "20 November",
    "text": "Prague Trials: A series of show trials purged the Czech Communist Party of Jews and insufficiently orthodox Stalinists."
  },
  {
    "year": 1953,
    "day": "13 January",
    "text": "An article in Pravda accused some of the nation's most prominent doctors – particularly Jews – of participating in a vast conspiracy to poison top Soviet leaders."
  },
  {
    "year": 1953,
    "day": "1 March",
    "text": "After an all-night dinner with party members Lavrenty Beria, Nikolai Bulganin, Nikita Khrushchev and Georgy Malenkov, Stalin suffered a paralyzing stroke."
  },
  {
    "year": 1953,
    "day": "5 March",
    "text": "Stalin died."
  },
  {
    "year": 1953,
    "day": "6 March",
    "text": "Malenkov succeeded Stalin as Premier and First Secretary of the Communist Party."
  },
  {
    "year": 1953,
    "day": "14 March",
    "text": "Khrushchev became First Secretary."
  },
  {
    "year": 1953,
    "day": "3 April",
    "text": "The Presidium of the Central Committee of the Communist Party officially acquitted those arrested in connection with the so-called \"doctors' plot\"."
  },
  {
    "year": 1953,
    "day": "8 April",
    "text": "First Indochina War: Viet Minh and Pathet Lao forces invaded Laos and attacked French bases there."
  },
  {
    "year": 1953,
    "day": "16 June",
    "text": "Uprising of 1953 in East Germany: In response to a 10 percent increase in work quotas, between 60 and 80 construction workers went on strike in East Berlin. Their numbers quickly swelled and a general strike and protests were called for the next day."
  },
  {
    "year": 1953,
    "day": "17 June",
    "text": "Uprising of 1953 in East Germany: 100,000 protestors gathered at dawn, demanding the reinstatement of old work quotas and, later, the resignation of the East German government. At noon German police trapped many of the demonstrators in an open square; Soviet tanks fired on the crowd, killing hundreds and ending the protest."
  },
  {
    "year": 1953,
    "day": "26 June",
    "text": "Beria was arrested at a special meeting of the Presidium."
  },
  {
    "year": 1953,
    "day": "27 July",
    "text": "Korean War: An armistice was signed, ending the conflict."
  },
  {
    "year": 1953,
    "day": "7 September",
    "text": "Khrushchev was confirmed as head of the Central Committee."
  },
  {
    "year": 1954,
    "day": "13 March",
    "text": "Battle of Dien Bien Phu: Viet Minh forces loosed a massive artillery barrage against the surrounded French airbase at Dien Bien Phu."
  },
  {
    "year": 1954,
    "day": "7 May",
    "text": "Battle of Dien Bien Phu: The battle ended in a French defeat."
  },
  {
    "year": 1954,
    "day": "16 May",
    "text": "Kengir Uprising: Prisoners at a Gulag adjacent to the Kazakh village of Kengir occupied the camp's service yard."
  },
  {
    "year": 1954,
    "day": "25 June",
    "text": "Kengir Uprising: The prison camp at Kengir was invaded and subdued by Soviet troops and tanks."
  },
  {
    "year": 1954,
    "day": "21 July",
    "text": "Geneva Conference (1954): The signing of the Geneva Accords promised a complete French withdrawal, partitioned Vietnam into a Communist North and a monarchist South, and scheduled unifying elections for July 1956."
  },
  {
    "year": 1955,
    "day": "2 June",
    "text": "Khrushchev and Tito issued the Belgrade declaration, which declared that \"different forms of Socialist development are solely the concern of the individual countries."
  },
  {
    "year": 1955,
    "day": "July",
    "text": "Ho Chi Minh visited Moscow and agreed to accept Soviet aid."
  },
  {
    "year": 1956,
    "day": "25 February",
    "text": "At a closed session of the 20th Party Congress, Khrushchev read the \"Secret Speech,\" On the Personality Cult and its Consequences, denouncing the actions of his predecessor Stalin. The speech weakened the hand of the Stalinists in the Soviet government."
  },
  {
    "year": 1956,
    "day": "17 April",
    "text": "The Cominform was officially dissolved."
  },
  {
    "year": 1956,
    "day": "28 June",
    "text": "Poznań 1956 protests: Poles upset with the slow pace of destalinization turned to protests, and then to violent riots."
  },
  {
    "year": 1956,
    "day": "29 June",
    "text": "Poznań 1956 protests: Konstantin Rokossovsky, the Polish minister of defense, ordered the military in to end the riots. At least 74 civilians were killed."
  },
  {
    "year": 1956,
    "day": "16 July",
    "text": "The Karelo-Finnish SSR became the Karelian ASSR of the Russian SFSR."
  },
  {
    "year": 1956,
    "day": "19 October",
    "text": "The liberal Władysław Gomułka was elected leader of the Polish Communist party."
  },
  {
    "year": 1956,
    "day": "23 October",
    "text": "1956 Hungarian Revolution: A small pro-Gomułka demonstration in Budapest expanded into a 100,000 head protest. The protestors marched on Parliament; when they were fired on by the Hungarian Security Police, they turned violent and began to arm themselves. An emergency meeting of the Central Committee appointed the reformist Imre Nagy Prime Minister."
  },
  {
    "year": 1956,
    "day": "31 October",
    "text": "1956 Hungarian Revolution: Hungary under Nagy withdrew from the Warsaw Pact."
  },
  {
    "year": 1956,
    "day": "4 November",
    "text": "1956 Hungarian Revolution: A Soviet invasion, involving infantry, artillery, airstrikes, and some 6,000 tanks entered Budapest. 2,500 Hungarians were killed in the ensuing battle."
  },
  {
    "year": 1956,
    "day": "8 November",
    "text": "1956 Hungarian Revolution: Pro-Soviet János Kádár announced the formation of a new \"Revolutionary Worker-Peasant Government,\" with himself as Prime Minister and leader of the Communist Party."
  },
  {
    "year": 1956,
    "day": "2 December",
    "text": "Cuban Revolution: Fidel Castro and his followers in the 26 July Movement landed in Cuba."
  },
  {
    "year": 1956,
    "day": "10 December",
    "text": "Angolan War of Independence: Two Angolan independence movements united to form the Marxist Popular Movement for the Liberation of Angola."
  },
  {
    "year": 1957,
    "day": "18 June",
    "text": "Led by the Stalinist Anti-Party Group, the Presidium voted to depose Khrushchev as First Secretary. The Presidium reversed its vote under pressure from Khrushchev and the defense minister and deferred the decision to a later meeting of the full Central Committee."
  },
  {
    "year": 1957,
    "day": "29 June",
    "text": "A Central Committee vote affirmed Khrushchev as First Secretary and deposed Anti-Party Group members Molotov, Kaganovich, and Malenkov from the Secretariat of the CPSU Central Committee."
  },
  {
    "year": 1958,
    "day": "27 March",
    "text": "Khrushchev replaced Bulganin as Premier of the Soviet Union."
  },
  {
    "year": 1959,
    "day": "1 January",
    "text": "Cuban Revolution: Cuban president Fulgencio Batista fled Cuba for the Dominican Republic."
  },
  {
    "year": 1960,
    "day": "16 April",
    "text": "Sino-Soviet Split: A Chinese Communist Party newspaper accused the Soviet leadership of \"revisionism."
  },
  {
    "year": 1960,
    "day": "16 July",
    "text": "Sino-Soviet Split: Moscow recalled thousands of Soviet advisers from China and ended economic and military aid."
  },
  {
    "year": 1960,
    "day": "20 December",
    "text": "Vietnam War: The National Front for the Liberation of Vietnam was formed, with the intent to overthrow the government of South Vietnam."
  },
  {
    "year": 1961,
    "day": "17 April",
    "text": "Bay of Pigs Invasion: After a U.S. bombing run against the Cuban air force, a group of 1,500 armed exiles landed at the Bay of Pigs on the southern coast. As the invasion faltered, President John F. Kennedy called off the airstrikes."
  },
  {
    "year": 1961,
    "day": "20 April",
    "text": "Bay of Pigs Invasion: Castro announced that all the invaders had been defeated."
  },
  {
    "year": 1961,
    "day": "13 August",
    "text": "Construction began on the Berlin Wall."
  },
  {
    "year": 1961,
    "day": "2 December",
    "text": "In a nationally broadcast speech, Castro declared he was a Marxist-Leninist and that Cuba was going to adopt Communism."
  },
  {
    "year": 1961,
    "day": "10 December",
    "text": "Sino-Albanian split: The People's Republic of China severed diplomatic ties with Albania."
  },
  {
    "year": 1962,
    "day": "2 June",
    "text": "Novocherkassk massacre: Soviet workers gathered in the town square of Novocherkassk to protest an increase in food prices and work quotas. Shots were fired at the rioters, killing 25 and injuring 87 people."
  },
  {
    "year": 1962,
    "day": "25 June",
    "text": "Mozambican War of Independence: The Mozambican Liberation Front (FRELIMO) was founded."
  },
  {
    "year": 1962,
    "day": "16 October",
    "text": "Cuban Missile Crisis: President Kennedy is shown aerial photos from U-2 surveillance flights showing missile bases in Cuba. The thirteen days marking the most dangerous period of the Cuban Missile Crisis begin."
  },
  {
    "year": 1962,
    "day": "22 October",
    "text": "Cuban Missile Crisis: Kennedy announced that any nuclear missile attack from Cuba would be regarded as an attack by the Soviet Union, and that the island would be placed under \"quarantine\" to prevent further weapons shipments."
  },
  {
    "year": 1962,
    "day": "26 October",
    "text": "Cuban Missile Crisis: The Soviet Union offered to withdraw the missiles in return for a U.S. guarantee not to invade Cuba or support any invasion."
  },
  {
    "year": 1962,
    "day": "28 October",
    "text": "Cuban Missile Crisis: Khrushchev announced that he had ordered the removal of the Soviet missiles in Cuba."
  },
  {
    "year": 1964,
    "day": "14 October",
    "text": "Khrushchev's rivals in the party deposed him at a Central Committee meeting. Leonid Brezhnev and Alexei Kosygin assumed power as First Secretary and Premier, respectively."
  },
  {
    "year": 1965,
    "day": "1 January",
    "text": "The Marxist People's Democratic Party of Afghanistan (PDPA) held its first congress."
  },
  {
    "year": 1967,
    "day": "7 February",
    "text": "Sino-Soviet split: The Chinese government announced that it could no longer guarantee the safety of Soviet diplomats outside the embassy building."
  },
  {
    "year": 1967,
    "day": "10 June",
    "text": "The Soviet Union severed diplomatic relations with Israel. see Soviet Union and the Arab-Israeli conflict"
  },
  {
    "year": 1968,
    "day": "5 January",
    "text": "Prague Spring: The liberal Alexander Dubček was appointed to succeed Antonín Novotný as First Secretary of the Communist Party of Czechoslovakia."
  },
  {
    "year": 1968,
    "day": "5 April",
    "text": "Prague Spring: The Czech Communist Party published their Action Programme. This document guaranteed a number of new freedoms including free speech, travel, debate and association."
  },
  {
    "year": 1968,
    "day": "20 August",
    "text": "Prague Spring: Between 200,000 and 600,000 Warsaw Pact troops crossed the Czechoslovakian border."
  },
  {
    "year": 1968,
    "day": "21 August",
    "text": "Prague Spring: Leading KSČ liberals – including Dubček – were arrested, flown to Moscow and forced to repeal the reforms of the Prague Spring. They agreed to the presence of Soviet troops in Czechoslovakia."
  },
  {
    "year": 1969,
    "day": "2 March",
    "text": "Sino-Soviet border conflict: A Soviet patrol came into armed conflict with Chinese forces on Zhenbao Island."
  },
  {
    "year": 1969,
    "day": "June",
    "text": "Qahtan al-Shabi, president of the People's Republic of South Yemen, was overthrown and replaced by Salim Rubayi Ali of the Marxist National Liberation Front."
  },
  {
    "year": 1969,
    "day": "21 October",
    "text": "Somali military and police occupied the capital of Mogadishu. The Supreme Revolutionary Council was established as the new government, with the Marxist revolutionary Siad Barre at its head."
  },
  {
    "year": 1973,
    "day": "27 January",
    "text": "Vietnam War: The Paris Peace Accords pledged the signatory parties to \"respect the independence, sovereignty, unity, and territorial integrity of Vietnam as recognized by the 1954 Geneva Agreements on Vietnam,\" and promised a complete withdrawal of United States forces from Vietnam and Laos."
  },
  {
    "year": 1974,
    "day": "11 July",
    "text": "The Soviet Union signed a treaty of friendship and cooperation with the Somali government."
  },
  {
    "year": 1974,
    "day": "12 September",
    "text": "Ethiopian emperor Haile Selassie was overthrown by a council of military officers, the Derg."
  },
  {
    "year": 1974,
    "day": "20 December",
    "text": "The Derg declared that socialism was the new ideology of the Ethiopian state."
  },
  {
    "year": 1975,
    "day": "31 January",
    "text": "Angolan War of Independence: A transitional unity government, consisting of the National Liberation Front of Angola, the Soviet-backed MPLA, and the Maoist UNITA, took office under the terms of the Alvor Agreement."
  },
  {
    "year": 1975,
    "day": "11 March",
    "text": "Vietnam War: A large-scale North Vietnamese offensive began with the conquest of Buon Ma Thuot."
  },
  {
    "year": 1975,
    "day": "27 March",
    "text": "The Pathet Lao began a military offensive against the Laotian government."
  },
  {
    "year": 1975,
    "day": "30 April",
    "text": "Fall of Saigon: The South Vietnamese capital of Saigon was captured by the Vietnam People's Army."
  },
  {
    "year": 1975,
    "day": "25 June",
    "text": "Mozambican War of Independence: The FRELIMO government received independence from Portugal. Party leader Samora Machel, a Marxist, became the nation's first president."
  },
  {
    "year": 1975,
    "day": "10 November",
    "text": "Soviet Union and the Arab-Israeli conflict: The United Nations General Assembly adopted Resolution 3379 declaring the \"Zionism is a form of racism and racial discrimination."
  },
  {
    "year": 1975,
    "day": "11 November",
    "text": "Angolan Civil War: Portugal accepted a declaration of independence from the MPLA, which controlled the Angolan capital of Luanda."
  },
  {
    "year": 1975,
    "day": "2 December",
    "text": "The king of Laos abdicated the throne, leaving leadership of the country to the Communist Pathet Lao."
  },
  {
    "year": 1977,
    "day": "23 July",
    "text": "Ogaden War: The Somali National Army invaded the Ogaden region in eastern Ethiopia."
  },
  {
    "year": 1977,
    "day": "7 September",
    "text": "Ogaden War: The Soviet Union ended its arms shipments to the Somali government."
  },
  {
    "year": 1977,
    "day": "13 November",
    "text": "Ogaden War: Barre cancelled the Somali-Soviet treaty of friendship."
  },
  {
    "year": 1978,
    "day": "28 April",
    "text": "Saur Revolution: Military units loyal to the PDPA assaulted the Afghan Presidential palace, killing President Mohammed Daoud Khan."
  },
  {
    "year": 1978,
    "day": "1 May",
    "text": "Saur Revolution: The PDPA installed its leader, Nur Muhammad Taraki, as President of Afghanistan."
  },
  {
    "year": 1978,
    "day": "July",
    "text": "A rebellion against the new Afghan government began with an uprising in Nuristan."
  },
  {
    "year": 1978,
    "day": "October",
    "text": "Brezhnev's poliboro sizes up Karol Cardinal Wojtyla of Poland when he is elected Pope John Paul II on 16 October and delivers his \"be not afraid\" speech on 22 October's papal inauguration."
  },
  {
    "year": 1978,
    "day": "5 December",
    "text": "A treaty was signed that permitted deployment of the Soviet military at the Afghan government's request."
  },
  {
    "year": 1978,
    "day": "25 December",
    "text": "Cambodian-Vietnamese War: The Vietnamese army invaded Cambodia."
  },
  {
    "year": 1979,
    "day": "7 January",
    "text": "Cambodian-Vietnamese War: The Vietnamese army captured Phnom Penh, ending the reign of the Khmer Rouge."
  },
  {
    "year": 1979,
    "day": "10 January",
    "text": "Cambodian-Vietnamese War: The People's Republic of Kampuchea was established."
  },
  {
    "year": 1979,
    "day": "19 July",
    "text": "The armed forces of the Marxist Sandinista National Liberation Front (FSLN) entered Managua."
  },
  {
    "year": 1979,
    "day": "14 September",
    "text": "Taraki was murdered by supporters of Prime Minister Hafizullah Amin."
  },
  {
    "year": 1979,
    "day": "24 December",
    "text": "Soviet–Afghan War: Fearing the collapse of the Amin regime, the Soviet army invaded Afghanistan."
  },
  {
    "year": 1979,
    "day": "27 December",
    "text": "Operation Storm-333: Soviet troops occupied major governmental, military and media buildings in Kabul, including the Tajbeg Presidential Palace, and executed Prime Minister Amin."
  },
  {
    "year": 1980,
    "day": "22 January",
    "text": "Andrei Sakharov is exiled without charges to the closed industrial city of Gorki for opposing the invasion of Afghanistan."
  },
  {
    "year": 1980,
    "day": "6 February",
    "text": "The United States announces its planned boycott of the Moscow Olympics because of the invasion of Afghanistan."
  },
  {
    "year": 1980,
    "day": "17 September",
    "text": "The trade union Solidarity was founded in Poland."
  },
  {
    "year": 1980,
    "day": "10 October",
    "text": "The Farabundo Martí National Liberation Front (FMLN) was founded from an assortment of leftist and Communist Salvadoran revolutionary organizations."
  },
  {
    "year": 1981,
    "day": "13 December",
    "text": "In response to the growing influence of Solidarity, Wojciech Jaruzelski, the First Secretary of the Communist Party, declared martial law in Poland, under indirect threat of Soviet intervention."
  },
  {
    "year": 1982,
    "day": "25 January",
    "text": "Suslov died after a severe stroke."
  },
  {
    "year": 1982,
    "day": "10 November",
    "text": "Brezhnev died of a heart attack."
  },
  {
    "year": 1982,
    "day": "12 November",
    "text": "Yuri Andropov was elected General Secretary of the CPSU."
  },
  {
    "year": 1983,
    "day": "19 October",
    "text": "The Grenadian military overthrew the government of Maurice Bishop and installed the pro-Soviet Stalinist Bernard Coard to lead the nation."
  },
  {
    "year": 1983,
    "day": "25 October",
    "text": "Invasion of Grenada: The United States and its Caribbean allies toppled the Coard government."
  },
  {
    "year": 1984,
    "day": "9 February",
    "text": "Andropov died after a lengthy kidney disease and was succeeded as General Secretary by Konstantin Chernenko."
  },
  {
    "year": 1984,
    "day": "8 May",
    "text": "Chernenko announces a Soviet-bloc boycott of the Los Angeles-held Summer Olympics, citing security concerns for its athletes."
  },
  {
    "year": 1985,
    "day": "10 March",
    "text": "Chernenko died of emphysema."
  },
  {
    "year": 1985,
    "day": "11 March",
    "text": "The Politburo unanimously supported Mikhail Gorbachev as General Secretary of the Communist Party."
  },
  {
    "year": 1988,
    "day": "14 April",
    "text": "Soviet–Afghan War: The Soviet government signed the Geneva Accords, which included a timetable for withdrawing their armed forces."
  },
  {
    "year": 1988,
    "day": "27 April",
    "text": "A strike at the V.I. Lenin Steel Mill in Nowa Huta touched off months of strikes across Poland."
  },
  {
    "year": 1988,
    "day": "13 April",
    "text": "Singing Revolution: The Popular Front of Estonia was founded."
  },
  {
    "year": 1988,
    "day": "3 June",
    "text": "Singing Revolution: The liberalization movement Sąjūdis was founded in Lithuania."
  },
  {
    "year": 1988,
    "day": "9 October",
    "text": "Singing Revolution: The Popular Front of Latvia was founded."
  },
  {
    "year": 1988,
    "day": "15 November",
    "text": "Soviet Union and the Arab-Israeli conflict: The Soviet Union recognizes the independence of the State of Palestine declared by the Palestine Liberation Organization."
  },
  {
    "year": 1989,
    "day": "15 February",
    "text": "Soviet–Afghan War: The last Soviet troops left the country."
  },
  {
    "year": 1989,
    "day": "4 April",
    "text": "The Polish Round Table Agreement legalized independent trade unions and reinstated the Senate."
  },
  {
    "year": 1989,
    "day": "4 June",
    "text": "Partially-free elections were held to the Polish parliament, resulting in a landslide Solidarity victory."
  },
  {
    "year": 1989,
    "day": "23 August",
    "text": "Singing Revolution: Two million people joined hands to form the Baltic Way across Estonia, Latvia and Lithuania to demonstrate for independence."
  },
  {
    "year": 1989,
    "day": "23 October",
    "text": "The Hungarian parliament declared their country a republic."
  },
  {
    "year": 1989,
    "day": "9 November",
    "text": "The East German government loosened restrictions on travel into the West, effecting the end of the Berlin Wall."
  },
  {
    "year": 1989,
    "day": "11 November",
    "text": "El Salvador Civil War: The FMLN launched an offensive that would capture part of San Salvador."
  },
  {
    "year": 1989,
    "day": "17 November",
    "text": "Velvet Revolution: An anti-Communist protest in Czechoslovakia was ended violently by the police."
  },
  {
    "year": 1989,
    "day": "28 November",
    "text": "Velvet Revolution: The Communist Party of Czechoslovakia announced the end of its monopoly on political power."
  },
  {
    "year": 1989,
    "day": "1 December",
    "text": "Mikhail Gorbachev meets with Pope John Paul II at the Vatican."
  },
  {
    "year": 1989,
    "day": "7 December",
    "text": "Singing Revolution: The Lithuanian parliament ended the political monopoly of the Communist Party of Lithuania."
  },
  {
    "year": 1989,
    "day": "16 December",
    "text": "Romanian Revolution of 1989: A protest broke out in Timişoara in response to an attempt by the government to evict a dissident Hungarian Reformed pastor, László Tőkés."
  },
  {
    "year": 1989,
    "day": "25 December",
    "text": "Romanian Revolution of 1989: Romanian dictator Nicolae Ceauşescu and his wife, Elena, were captured in the countryside and executed."
  },
  {
    "year": 1990,
    "day": "15 January",
    "text": "The Bulgarian Communist Party repealed its constitutional supremacy."
  },
  {
    "year": 1990,
    "day": "23 February",
    "text": "Singing Revolution: Elections in Lithuania gave Sąjūdis an absolute majority in the legislature."
  },
  {
    "year": 1990,
    "day": "11 March",
    "text": "Singing Revolution: The Lithuanian government declared its independence from the Soviet Union."
  },
  {
    "year": 1990,
    "day": "18 March",
    "text": "Singing Revolution: Elections to the Latvian Supreme Soviet gave the majority of seats to a pro-independence coalition, led by the Popular Front of Latvia."
  },
  {
    "year": 1990,
    "day": "8 April",
    "text": "The Hungarian Socialist Party received only 8% of the seats in elections to parliament."
  },
  {
    "year": 1990,
    "day": "9 June",
    "text": "Velvet Revolution: Elections in Czechoslovakia reduced the Communist Party to a minority."
  },
  {
    "year": 1990,
    "day": "12 June",
    "text": "The First Congress of People's Deputies of Russia issued the Declaration of State Sovereignty of the Russian Soviet Federative Socialist Republic."
  },
  {
    "year": 1990,
    "day": "21 August",
    "text": "Conflict in Transnistria and Gagauzia: The Gagauz declared a new soviet republic on Moldavian soil."
  },
  {
    "year": 1991,
    "day": "11 January",
    "text": "January Events: Soviet troops violently seized important buildings in cities throughout Lithuania."
  },
  {
    "year": 1991,
    "day": "11 March",
    "text": "A referendum on the future of the Soviet Union was held, with nearly 70% of voters supporting the renewed Union of Sovereign States"
  },
  {
    "year": 1991,
    "day": "23 May",
    "text": "The Moldavian SSR became the Republic of Moldova. Soviet Union referendum, 1991"
  },
  {
    "year": 1991,
    "day": "12 June",
    "text": "1991 Russian presidential election: Boris Yeltsin was elected to the presidency of the Russian SFSR."
  },
  {
    "year": 1991,
    "day": "19 August",
    "text": "Soviet coup attempt of 1991: A group of high-ranking officials calling themselves the State Emergency Committee announced that Gennady Yanayev was to replace Gorbachev as President of the Soviet Union."
  },
  {
    "year": 1991,
    "day": "20 August",
    "text": "Singing Revolution: The Estonian government declared its independence."
  },
  {
    "year": 1991,
    "day": "21 August",
    "text": "Singing Revolution: The government of Latvia declared its independence."
  },
  {
    "year": 1991,
    "day": "21 August",
    "text": "Soviet coup attempt of 1991: The military refused State Emergency Committee orders to take the capital. The leaders of the coup were arrested."
  },
  {
    "year": 1991,
    "day": "24 August",
    "text": "The Ukrainian parliament adopted the Declaration of Independence of Ukraine."
  },
  {
    "year": 1991,
    "day": "27 August",
    "text": "Moldova declared independence."
  },
  {
    "year": 1991,
    "day": "30 August",
    "text": "The Kyrgyz SSR became the Republic of Kyrgyzstan."
  },
  {
    "year": 1991,
    "day": "31 August",
    "text": "The Republic of Kyrgyzstan declared independence."
  },
  {
    "year": 1991,
    "day": "6 September",
    "text": "Singing Revolution: The Soviet Union recognized the independence of the Baltic states."
  },
  {
    "year": 1991,
    "day": "6 September",
    "text": "Militants belonging to the separatist All-National Congress of the Chechen People (NCChP) stormed a session of the Supreme Soviet of the Chechen-Ingush ASSR. NCChP leader Dzhokhar Dudaev was appointed to the presidency."
  },
  {
    "year": 1991,
    "day": "18 October",
    "text": "Soviet Union and the Arab-Israeli conflict: The Soviet Union restores full relations with Israel."
  },
  {
    "year": 1991,
    "day": "27 October",
    "text": "A national referendum confirmed the Dudaev presidency. Dudaev unilaterally declared the independence of the Chechen Republic of Ichkeria."
  },
  {
    "year": 1991,
    "day": "30 October",
    "text": "Soviet Union and the Arab-Israeli conflict: The Madrid Conference took place."
  },
  {
    "year": 1991,
    "day": "8 December",
    "text": "The leaders of Russia, Belarus and Ukraine signed the Belavezha Accords, dissolving the Soviet Union."
  },
  {
    "year": 1991,
    "day": "16 December",
    "text": "Soviet Union and the Arab-Israeli conflict: The United Nations General Assembly passes Resolution 46/86 effectively repealing Resolution 3379 passed in 1975."
  },
  {
    "year": 1991,
    "day": "26 December",
    "text": "The Supreme Soviet confirmed the dissolution of the Soviet Union."
  },
  {
    "year": 1993,
    "day": "21 September",
    "text": "Russian constitutional crisis of 1993: Yeltsin announced the dissolution of the Russian legislature. The legislature, in turn, responded by impeaching Yeltsin and declaring Aleksandr Rutskoy the new President of the Russian Federation."
  },
  {
    "year": 1993,
    "day": "4 October",
    "text": "Russian constitutional crisis of 1993: The army occupied the parliament building and arrested a number of its leaders."
  },
  {
    "year": 1993,
    "day": "12 December",
    "text": "Russian constitutional crisis of 1993: A new 5th Russian constitution was approved by referendum, vastly increasing the power of the presidency."
  },
  {
    "year": 1994,
    "day": "2 August",
    "text": "First Chechen War: The leader of the Russian-backed Provisional Council of the Chechen Republic announced his intention to overthrow the Dudaev government."
  },
  {
    "year": 1994,
    "day": "11 December",
    "text": "First Chechen War: Russian troops invaded Chechnya."
  },
  {
    "year": 1996,
    "day": "3 July",
    "text": "1996 Russian presidential election: Yeltsin narrowly defeated his Communist challenger, Gennady Zyuganov."
  },
  {
    "year": 1996,
    "day": "30 August",
    "text": "First Chechen War: The Khasav-Yurt Accord was signed, signaling the end of the war."
  },
  {
    "year": 1999,
    "day": "7 August",
    "text": "Dagestan War: A Chechnya-based militia invaded the Russian republic of Dagestan in support of local separatists."
  },
  {
    "year": 1999,
    "day": "16 August",
    "text": "The State Duma confirmed the appointment of Vladimir Putin as Prime Minister of Russia."
  },
  {
    "year": 1999,
    "day": "23 August",
    "text": "Dagestan War: The militias began their retreat back into Chechnya."
  },
  {
    "year": 1999,
    "day": "26 August",
    "text": "Second Chechen War: The militia that had invaded Dagestan was bombed inside Chechnya."
  },
  {
    "year": 1999,
    "day": "4 September",
    "text": "Russian apartment bombings: A car bomb outside of an apartment building in Buynaksk killed sixty-four people."
  },
  {
    "year": 1999,
    "day": "2 October",
    "text": "Second Chechen War: Russian ground troops invaded Chechnya."
  },
  {
    "year": 1999,
    "day": "8 December",
    "text": "The treaty of creation of the Union of Russia and Belarus was signed."
  },
  {
    "year": 1999,
    "day": "31 December",
    "text": "Boris Yeltsin resigned as President of the Russian Federation. Prime Minister Putin became acting president."
  },
  {
    "year": 2000,
    "day": "26 March",
    "text": "2000 Russian presidential election: Putin was elected President of Russia with 53 percent of the vote."
  },
  {
    "year": 2000,
    "day": "12 August",
    "text": "Russian submarine Kursk explosion: An explosion disabled the Russian submarine K-141 Kursk."
  }
]